perf/perf-recommendations.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 3
      name: warm-up
    - duration: 60
      arrivalRate: 3
      rampTo: 10
      name: ramp to load
    - duration: 60
      arrivalRate: 10
      name: sustained load
  defaults:
    headers:
      Content-Type: application/json
  plugins:
    expect: {}
  variables:
    email: "elena.ivanova@atelier.ru"
    password: "TasteTest#2024"
    userId: "u_elena"

scenarios:
  - name: Authenticated recommendations flow
    weight: 1
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "accessToken"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/recommendations/{{ userId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      - think: 0.5
      - get:
          url: "/recommend/user/{{ userId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200